#+title: Meetup 8

** 2.3.1 Quotation
We're introduced to the notion of quotation. Quotation allows us to identify lists and symbols as data objects rather than as expressions to be evaluated. An object is quoted using a single quote ='=.

The book has a great example that relates the concept to English:

If you tell someone "Say your name", you'd expect them to tell you what their name is.
If you tell them instead "Say 'your name'", you'd expect them to say "your name", verbatim.

Quoting a lisp expression is like quoting "your name".

An example showing how quoting allows us to differentiate between a symbol and its value:

#+begin_src scheme :results output
(define a 1)
(define b 2)

(display (list a b))
;; => (1 2)
(newline)

(display (list 'a 'b))
;; => (a b)
(newline)

(display (list 'a b))
;; => (a 2)
#+end_src

#+RESULTS:
: (1 2)
: (a b)
: (a 2)

Lists can be quoted too:

#+begin_src scheme :results output
(display (car '(a b c)))
;; => a
(newline)

(display (cdr '(a b c)))
;; => (b c)
#+end_src

#+RESULTS:
: a
: (b c)

We came across the concept of nil/the empty list earlier in the book. Most modern Schemes no longer provide =nil=, so we had to use ='()=. Hopefully now that we've seen quotation, it's clear how that represents the empty list.

The =eq?= primitive lets us compare symbols for equality:

#+begin_src scheme :results output
(display (eq? 'a 'a))
;; => #t (true)
(newline)

(display (eq? 'a 'b))
;; => #f (false)
(newline)

(display (eq? 'a 42))
;; => #f (false)
(newline)
#+end_src

#+RESULTS:
: #t
: #f
: #f

We're given the definition of an example procedure, =memq=, which uses =eq?=. It takes a symbol and a list, then returns =#f= (false) if the symbol is not contained in the list, or a sublist starting with the first occurrence of the given symbol:

#+begin_src scheme :results output
(define (memq item x)
  (cond ((null? x) #f) ;; x is empty; item's not there
        ((eq? item (car x)) x) ;; special sauce of memq: eq?. the car of the list is item, so return the list
        (else (memq item (cdr x))))) ;; first element of x is not item, so check the rest of the list

(display (memq 'apple '(pear banana prune)))
;; => #f (false)
(newline)

(display (memq 'apple '(x (apple sauce) y apple pear)))
;; => (apple pear)
#+end_src

#+RESULTS:
: #f
: (apple pear)


